/*
	//////////////////////////////////////////////////////////

	Это программа нужно для генерации паролей.
	
	Вывод происходит в файл: genpas.txt
	Пароль генерируется из символов c файла: alphabet.txt

	Программа может генерировать пароли длинной:
		1.) От 1 до (Ввёдённого вами пароля)
		2.) (Только ввёдённый вами пароль)

	//////////////////////////////////////////////////////////
*/

#include <iostream>
#include <stdexcept>
#include "globalVariables.h"
#include "genpas.h"
#include "logic.h"


int main(void)
{
	try
	{
		logic();
	}
	catch (...)
	{
		std::cout << "Error." << std::endl;
	}

	return(0);
}